tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf66k80_tdd.h
#define B3FILHIT2                     1649
#define B3CON_RTREN                   1650
#define B3CON_FILHIT3_TXREQ           1651
#define B3TXREQ                       1652
#define B3CON_FILHIT3                 1653
#define B3FILHIT3                     1654
#define B3CON_TXREQ                   1655
#define B3CON_FILHIT4                 1656
#define B3CON_TXERR                   1657
#define B3CON_FILHIT4_TXERR           1658
#define B3TXERR                       1659
#define B3FILHIT4                     1660
#define B3CON_RXRTRRO                 1661
#define B3TXLARB                      1662
#define B3CON_RXRTRRO_TXLARB          1663
#define B3CON_TXLARB                  1664
#define B3RTRRO                       1665
#define B3CON_RXM1                    1666
#define B3TXABT                       1667
#define B3CON_RXM1_TXABT              1668
#define B3CON_TXABT                   1669
#define B3RXM1                        1670
#define B3CON_RXFUL_TXBIF             1671
#define B3RXFUL                       1672
#define B3CON_TXBIF                   1673
#define B3TXB3IF                      1674
#define B3CON_RXFUL                   1675
#define B3SIDH                        1676
#define B3SIDH_SID3                   1677
#define B3SIDH_SID                    1678
#define B3SID3                        1679
#define B3SIDH_SID4                   1680
#define B3SID4                        1681
#define B3SIDH_SID5                   1682
#define B3SID5                        1683
#define B3SIDH_SID6                   1684
#define B3SID6                        1685
#define B3SIDH_SID7                   1686
#define B3SID7                        1687
#define B3SIDH_SID8                   1688
#define B3SID8                        1689
#define B3SIDH_SID9                   1690
#define B3SID9                        1691
#define B3SID10                       1692
#define B3SIDH_SID10                  1693
#define B3SIDL                        1694
#define B3EID16                       1695
#define B3SIDL_EID                    1696
#define B3SIDL_EID16                  1697
#define B3EID17                       1698
#define B3SIDL_EID17                  1699
#define B3EXIDE                       1700
#define B3SIDL_EXIDE                  1701
#define B3EXID                        1702
#define B3SIDL_SRR                    1703
#define B3SRR                         1704
#define B3SIDL_SID                    1705
#define B3SIDL_SID0                   1706
#define B3SID0                        1707
#define B3SIDL_SID1                   1708
#define B3SID1                        1709
#define B3SIDL_SID2                   1710
#define B3SID2                        1711
#define B3EIDH                        1712
#define B3EID8                        1713
#define B3EIDH_EID                    1714
#define B3EIDH_EID8                   1715
#define B3EID9                        1716
#define B3EIDH_EID9                   1717
#define B3EIDH_EID10                  1718
#define B3EID10                       1719
#define B3EIDH_EID11                  1720
#define B3EID11                       1721
#define B3EIDH_EID12                  1722
#define B3EID12                       1723
#define B3EIDH_EID13                  1724
#define B3EID13                       1725
#define B3EIDH_EID14                  1726
#define B3EID14                       1727
#define B3EID15                       1728
#define B3EIDH_EID15                  1729
#define B3EIDL                        1730
#define B3EID0                        1731
#define B3EIDL_EID0                   1732
#define B3EIDL_EID                    1733
#define B3EID1                        1734
#define B3EIDL_EID1                   1735
#define B3EID2                        1736
#define B3EIDL_EID2                   1737
#define B3EID3                        1738
#define B3EIDL_EID3                   1739
#define B3EID4                        1740
#define B3EIDL_EID4                   1741
#define B3EID5                        1742
#define B3EIDL_EID5                   1743
#define B3EID6                        1744
#define B3EIDL_EID6                   1745
#define B3EID7                        1746
#define B3EIDL_EID7                   1747
#define B3DLC                         1748
#define B3DLC_DLC0                    1749
#define B3DLC0                        1750
#define B3DLC_DLC                     1751
#define B3DLC_DLC1                    1752
#define B3DLC1                        1753
#define B3DLC_DLC2                    1754
#define B3DLC2                        1755
#define B3DLC_DLC3                    1756
#define B3DLC3                        1757
#define B3DLC_RB0                     1758
#define B3RB0                         1759
#define B3DLC_RB                      1760
#define B3DLC_RB1                     1761
#define B3RB1                         1762
#define B3DLC_TXRTR                   1763
#define B3RXRTR                       1764
#define B3DLC_RXRTR                   1765
#define B3DLC_RXRTR_TXRTR             1766
#define B3D0                          1767
#define B3D00                         1768
#define B3D01                         1769
#define B3D02                         1770
#define B3D03                         1771
#define B3D04                         1772
#define B3D05                         1773
#define B3D06                         1774
#define B3D07                         1775
#define B3D1                          1776
#define B3D10                         1777
#define B3D11                         1778
#define B3D12                         1779
#define B3D13                         1780
#define B3D14                         1781
#define B3D15                         1782
#define B3D16                         1783
#define B3D17                         1784
#define B3D2                          1785
#define B3D20                         1786
#define B3D21                         1787
#define B3D22                         1788
#define B3D23                         1789
#define B3D24                         1790
#define B3D25                         1791
#define B3D26                         1792
#define B3D27                         1793
#define B3D3                          1794
#define B3D30                         1795
#define B3D31                         1796
#define B3D32                         1797
#define B3D33                         1798
#define B3D34                         1799
#define B3D35                         1800
#define B3D36                         1801
#define B3D37                         1802
#define B3D4                          1803
#define B3D40                         1804
#define B3D41                         1805
#define B3D42                         1806
#define B3D43                         1807
#define B3D44                         1808
#define B3D45                         1809
#define B3D46                         1810
#define B3D47                         1811
#define B3D5                          1812
#define B3D50                         1813
#define B3D51                         1814
#define B3D52                         1815
#define B3D53                         1816
#define B3D54                         1817
#define B3D55                         1818
#define B3D56                         1819
#define B3D57                         1820
#define B3D60                         1821
#define B3D6                          1822
#define B3D61                         1823
#define B3D62                         1824
#define B3D63                         1825
#define B3D64                         1826
#define B3D65                         1827
#define B3D66                         1828
#define B3D67                         1829
#define B3D7                          1830
#define B3D70                         1831
#define B3D71                         1832
#define B3D72                         1833
#define B3D73                         1834
#define B3D74                         1835
#define B3D75                         1836
#define B3D76                         1837
#define B3D77                         1838
#define CANSTAT_RO6                   1839
#define CANSTAT_RO6_EICODE0           1840
#define CANSTAT_RO6_EICODE1_ICODE0    1841
#define CANSTAT_RO6_ICODE0            1842
#define CANSTAT_RO6_EICODE1           1843
#define CANSTAT_RO6_ICODE1            1844
#define CANSTAT_RO6_EICODE2_ICODE1    1845
#define CANSTAT_RO6_EICODE2           1846
#define CANSTAT_RO6_EICODE3_ICODE2    1847
#define CANSTAT_RO6_EICODE3           1848
#define CANSTAT_RO6_ICODE2            1849
#define CANSTAT_RO6_EICODE4           1850
#define CANSTAT_RO6_OPMODE            1851
#define CANSTAT_RO6_OPMODE0           1852
#define CANSTAT_RO6_OPMODE1           1853
#define CANSTAT_RO6_OPMODE2           1854
#define CANCON_RO6                    1855
#define CANCON_RO6_FP0                1856
#define CANCON_RO6_FP1                1857
#define CANCON_RO6_WIN0               1858
#define CANCON_RO6_WIN0_FP1           1859
#define CANCON_RO6_FP2                1860
#define CANCON_RO6_WIN1_FP2           1861
#define CANCON_RO6_WIN1               1862
#define CANCON_RO6_WIN2               1863
#define CANCON_RO6_FP3                1864
#define CANCON_RO6_WIN2_FP3           1865
#define CANCON_RO6_ABAT               1866
#define CANCON_RO6_REQOP              1867
#define B4CON                         1868
#define B4CON_TXPRI0                  1869
#define B4CON_FILHIT0_TXPRI0          1870
#define B4TXPRI0                      1871
#define B4CON_FILHIT0                 1872
#define B4FILHIT0                     1873
#define B4CON_FILHIT1                 1874
#define B4CON_TXPRI1                  1875
#define B4CON_FILHIT1_TXPRI1          1876
#define B4TXPRI1                      1877
#define B4FILHIT1                     1878
#define B4CON_RTREN                   1879
#define B4CON_FILHIT2                 1880
#define B4RTREN                       1881
#define B4FILHIT2                     1882
#define B4CON_FILHIT2_RTREN           1883
#define B4CON_TXREQ                   1884
#define B4CON_FILHIT3_TXREQ           1885
#define B4TXREQ                       1886
#define B4CON_FILHIT3                 1887
#define B4FILHIT3                     1888
#define B4CON_TXERR                   1889
#define B4CON_FILHIT4_TXERR           1890
#define B4TXERR                       1891
#define B4CON_FILHIT4                 1892
#define B4FILHIT4                     1893
#define B4CON_TXLARB                  1894
#define B4TXLARB                      1895
#define B4CON_RXRTRRO_TXLARB          1896
#define B4RTRRO                       1897
#define B4CON_RXRTRRO                 1898
#define B4TXABT                       1899
#define B4CON_RXM1_TXABT              1900
#define B4CON_RXM1                    1901
#define B4CON_TXABT                   1902
#define B4RXM1                        1903
#define B4CON_TXBIF                   1904
#define B4CON_RXFUL_TXBIF             1905
#define B4TXB3IF                      1906
#define B4RXFUL                       1907
#define B4CON_RXFUL                   1908
#define B4SIDH                        1909
#define B4SIDH_SID3                   1910
#define B4SID3                        1911
#define B4SIDH_SID                    1912
#define B4SIDH_SID4                   1913
#define B4SID4                        1914
#define B4SID5                        1915
#define B4SIDH_SID5                   1916
#define B4SIDH_SID6                   1917
#define B4SID6                        1918
#define B4SID7                        1919
#define B4SIDH_SID7                   1920
#define B4SID8                        1921
#define B4SIDH_SID8                   1922
#define B4SID9                        1923
#define B4SIDH_SID9                   1924
#define B4SIDH_SID10                  1925
#define B4SID10                       1926
#define B4SIDL                        1927
#define B4EID16                       1928
#define B4SIDL_EID                    1929
#define B4SIDL_EID16                  1930
#define B4EID17                       1931
#define B4SIDL_EID17                  1932
#define B4EXIDE                       1933
#define B4SIDL_EXIDE                  1934
#define B4EXID                        1935
#define B4SIDL_SRR                    1936
#define B4SRR                         1937
#define B4SIDL_SID0                   1938
#define B4SID0                        1939
#define B4SIDL_SID                    1940
#define B4SIDL_SID1                   1941
#define B4SID1                        1942
#define B4SIDL_SID2                   1943
#define B4SID2                        1944
#define B4EIDH                        1945
#define B4EIDH_EID                    1946
#define B4EID8                        1947
#define B4EIDH_EID8                   1948
#define B4EID9                        1949
#define B4EIDH_EID9                   1950
#define B4EID10                       1951
#define B4EIDH_EID10                  1952
#define B4EID11                       1953
#define B4EIDH_EID11                  1954
#define B4EID12                       1955
#define B4EIDH_EID12                  1956
#define B4EID13                       1957
#define B4EIDH_EID13                  1958
#define B4EID14                       1959
#define B4EIDH_EID14                  1960
#define B4EID15                       1961
#define B4EIDH_EID15                  1962
#define B4EIDL                        1963
#define B4EID0                        1964
#define B4EIDL_EID                    1965
#define B4EIDL_EID0                   1966
#define B4EID1                        1967
#define B4EIDL_EID1                   1968
#define B4EID2                        1969
#define B4EIDL_EID2                   1970
#define B4EID3                        1971
#define B4EIDL_EID3                   1972
#define B4EID4                        1973
#define B4EIDL_EID4                   1974
#define B4EID5                        1975
#define B4EIDL_EID5                   1976
#define B4EID6                        1977
#define B4EIDL_EID6                   1978
#define B4EID7                        1979
#define B4EIDL_EID7                   1980
#define B4DLC                         1981
#define B4DLC_DLC0                    1982
#define B4DLC0                        1983
#define B4DLC_DLC                     1984
#define B4DLC_DLC1                    1985
#define B4DLC1                        1986
#define B4DLC_DLC2                    1987
#define B4DLC2                        1988
#define B4DLC_DLC3                    1989
#define B4DLC3                        1990
#define B4DLC_RB                      1991
#define B4DLC_RB0                     1992
#define B4RB0                         1993
#define B4DLC_RB1                     1994
#define B4RB1                         1995
#define B4DLC_RXRTR_TXRTR             1996
#define B4RXRTR                       1997
#define B4DLC_RXRTR                   1998
#define B4DLC_TXRTR                   1999
#define B4D0                          2000
#define B4D00                         2001
#define B4D01                         2002
#define B4D02                         2003
#define B4D03                         2004
#define B4D04                         2005
#define B4D05                         2006
#define B4D06                         2007
#define B4D07                         2008
#define B4D10                         2009
#define B4D1                          2010
#define B4D11                         2011
#define B4D12                         2012
#define B4D13                         2013
#define B4D14                         2014
#define B4D15                         2015
#define B4D16                         2016
#define B4D17                         2017
#define B4D2                          2018
#define B4D20                         2019
#define B4D21                         2020
#define B4D22                         2021
#define B4D23                         2022
#define B4D24                         2023
#define B4D25                         2024
#define B4D26                         2025
#define B4D27                         2026
#define B4D3                          2027
#define B4D30                         2028
#define B4D31                         2029
#define B4D32                         2030
#define B4D33                         2031
#define B4D34                         2032
#define B4D35                         2033
#define B4D36                         2034
#define B4D37                         2035
#define B4D4                          2036
#define B4D40                         2037
#define B4D41                         2038
#define B4D42                         2039
#define B4D43                         2040
#define B4D44                         2041
#define B4D45                         2042
#define B4D46                         2043
#define B4D47                         2044
#define B4D5                          2045
#define B4D50                         2046
#define B4D51                         2047
#define B4D52                         2048
#define B4D53                         2049
#define B4D54                         2050
#define B4D55                         2051
#define B4D56                         2052
#define B4D57                         2053
#define B4D6                          2054
#define B4D60                         2055
#define B4D61                         2056
#define B4D62                         2057
#define B4D63                         2058
#define B4D64                         2059
#define B4D65                         2060
#define B4D66                         2061
#define B4D67                         2062
#define B4D7                          2063
#define B4D70                         2064
#define B4D71                         2065
#define B4D72                         2066
#define B4D73                         2067
#define B4D74                         2068
#define B4D75                         2069
#define B4D76                         2070
#define B4D77                         2071
#define CANSTAT_RO5                   2072
#define CANSTAT_RO5_EICODE0           2073
#define CANSTAT_RO5_EICODE1           2074
#define CANSTAT_RO5_ICODE0            2075
#define CANSTAT_RO5_EICODE1_ICODE0    2076
#define CANSTAT_RO5_EICODE2           2077
#define CANSTAT_RO5_ICODE1            2078
#define CANSTAT_RO5_EICODE2_ICODE1    2079
#define CANSTAT_RO5_EICODE3           2080
#define CANSTAT_RO5_ICODE2            2081
#define CANSTAT_RO5_EICODE3_ICODE2    2082
#define CANSTAT_RO5_EICODE4           2083
#define CANSTAT_RO5_OPMODE0           2084
#define CANSTAT_RO5_OPMODE            2085
#define CANSTAT_RO5_OPMODE1           2086
#define CANSTAT_RO5_OPMODE2           2087
#define CANCON_RO5                    2088
#define CANCON_RO5_FP0                2089
#define CANCON_RO5_FP1                2090
#define CANCON_RO5_WIN0_FP1           2091
#define CANCON_RO5_WIN0               2092
#define CANCON_RO5_FP2                2093
#define CANCON_RO5_WIN1               2094
#define CANCON_RO5_WIN1_FP2           2095
#define CANCON_RO5_WIN2_FP3           2096
#define CANCON_RO5_WIN2               2097
#define CANCON_RO5_FP3                2098
#define CANCON_RO5_ABAT               2099
#define CANCON_RO5_REQOP              2100
#define B5CON                         2101
#define B5CON_FILHIT0_TXPRI0          2102
#define B5FILHIT0                     2103
#define B5TXPRI0                      2104
#define B5CON_TXPRI0                  2105
#define B5CON_FILHIT0                 2106
#define B5CON_FILHIT1_TXPRI1          2107
#define B5FILHIT1                     2108
#define B5TXPRI1                      2109
#define B5CON_TXPRI1                  2110
#define B5CON_FILHIT1                 2111
#define B5CON_FILHIT2_RTREN           2112
#define B5CON_FILHIT2                 2113
#define B5FILHIT2                     2114
#define B5CON_RTREN                   2115
#define B5RTREN                       2116
#define B5TXREQ                       2117
#define B5CON_TXREQ                   2118
#define B5CON_FILHIT3_TXREQ           2119
#define B5FILHIT3                     2120
#define B5CON_FILHIT3                 2121
#define B5CON_TXERR                   2122
#define B5FILHIT4                     2123
#define B5CON_FILHIT4                 2124
#define B5TXERR                       2125
#define B5CON_FILHIT4_TXERR           2126
#define B5RTRRO                       2127
#define B5CON_RXRTRRO_TXLARB          2128
#define B5CON_RXRTRRO                 2129
#define B5TXLARB                      2130
#define B5CON_TXLARB                  2131
#define B5RXM1                        2132
#define B5CON_RXM1_TXABT              2133
#define B5TXABT                       2134
#define B5CON_TXABT                   2135
#define B5CON_RXM1                    2136
#define B5CON_RXFUL                   2137
#define B5CON_TXBIF                   2138
#define B5TXBIF                       2139
#define B5CON_RXFUL_TXBIF             2140
#define B5RXFUL                       2141
#define B5SIDH                        2142
#define B5SIDH_SID                    2143
#define B5SID3                        2144
#define B5SIDH_SID3                   2145
#define B5SIDH_SID4                   2146
#define B5SID4                        2147
#define B5SIDH_SID5                   2148
#define B5SID5                        2149
#define B5SIDH_SID6                   2150
#define B5SID6                        2151
#define B5SIDH_SID7                   2152
#define B5SID7                        2153
#define B5SIDH_SID8                   2154
#define B5SID8                        2155
#define B5SIDH_SID9                   2156
#define B5SID9                        2157
#define B5SID10                       2158
#define B5SIDH_SID10                  2159
#define B5SIDL                        2160
#define B5SIDL_EID16                  2161
#define B5SIDL_EID                    2162
#define B5EID16                       2163
#define B5SIDL_EID17                  2164
#define B5EID17                       2165
#define B5EXID                        2166
#define B5EXIDE                       2167
#define B5SIDL_EXIDE                  2168
#define B5SIDL_SRR                    2169
#define B5SRR                         2170
#define B5SID0                        2171
#define B5SIDL_SID0                   2172
#define B5SIDL_SID                    2173
#define B5SID1                        2174
#define B5SIDL_SID1                   2175
#define B5SID2                        2176
#define B5SIDL_SID2                   2177
#define B5EIDH                        2178
#define B5EIDH_EID8                   2179
#define B5EIDH_EID                    2180
#define B5EID8                        2181
#define B5EIDH_EID9                   2182
#define B5EID9                        2183
#define B5EIDH_EID10                  2184
#define B5EID10                       2185
#define B5EIDH_EID11                  2186
#define B5EID11                       2187
#define B5EIDH_EID12                  2188
#define B5EID12                       2189
#define B5EIDH_EID13                  2190
#define B5EID13                       2191
#define B5EIDH_EID14                  2192
#define B5EID14                       2193
#define B5EIDH_EID15                  2194
#define B5EID15                       2195
#define B5EIDL                        2196
#define B5EIDL_EID                    2197
#define B5EID0                        2198
#define B5EIDL_EID0                   2199
#define B5EID1                        2200
#define B5EIDL_EID1                   2201
#define B5EID2                        2202
#define B5EIDL_EID2                   2203
#define B5EID3                        2204
#define B5EIDL_EID3                   2205
#define B5EID4                        2206
